tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1508_tdd.h
#define PWM1DCH5                      522
#define PWM1DCH6                      523
#define PWM1DCH7                      524
#define PWM1CON                       525
#define PWM1POL                       526
#define PWM1OUT                       527
#define PWM1OE                        528
#define PWM1EN                        529
#define PWM2DCL0                      530
#define PWM2DCL                       531
#define PWM2DCL1                      532
#define PWM2DCH0                      533
#define PWM2DCH                       534
#define PWM2DCH1                      535
#define PWM2DCH2                      536
#define PWM2DCH3                      537
#define PWM2DCH4                      538
#define PWM2DCH5                      539
#define PWM2DCH6                      540
#define PWM2DCH7                      541
#define PWM2CON                       542
#define PWM2POL                       543
#define PWM2OUT                       544
#define PWM2OE                        545
#define PWM2EN                        546
#define PWM3DCL0                      547
#define PWM3DCL                       548
#define PWM3DCL1                      549
#define PWM3DCH0                      550
#define PWM3DCH                       551
#define PWM3DCH1                      552
#define PWM3DCH2                      553
#define PWM3DCH3                      554
#define PWM3DCH4                      555
#define PWM3DCH5                      556
#define PWM3DCH6                      557
#define PWM3DCH7                      558
#define PWM3CON                       559
#define PWM3POL                       560
#define PWM3OUT                       561
#define PWM3OE                        562
#define PWM3EN                        563
#define PWM4DCL                       564
#define PWM4DCL0                      565
#define PWM4DCL1                      566
#define PWM4DCH0                      567
#define PWM4DCH                       568
#define PWM4DCH1                      569
#define PWM4DCH2                      570
#define PWM4DCH3                      571
#define PWM4DCH4                      572
#define PWM4DCH5                      573
#define PWM4DCH6                      574
#define PWM4DCH7                      575
#define PWM4CON                       576
#define PWM4POL                       577
#define PWM4OUT                       578
#define PWM4OE                        579
#define PWM4EN                        580
#define CWG1DBR0                      581
#define CWG1DBR                       582
#define CWG1DBR1                      583
#define CWG1DBR2                      584
#define CWG1DBR3                      585
#define CWG1DBR4                      586
#define CWG1DBR5                      587
#define CWG1DBF                       588
#define CWG1DBF0                      589
#define CWG1DBF1                      590
#define CWG1DBF2                      591
#define CWG1DBF3                      592
#define CWG1DBF4                      593
#define CWG1DBF5                      594
#define CWG1CON0                      595
#define G1CS0                         596
#define G1CS                          597
#define G1POLA                        598
#define G1POLB                        599
#define G1OEA                         600
#define G1OEB                         601
#define G1EN                          602
#define CWG1CON1                      603
#define G1IS0                         604
#define G1IS                          605
#define G1IS1                         606
#define G1IS2                         607
#define G1ASDLA                       608
#define G1ASDLA0                      609
#define G1ASDLA1                      610
#define G1ASDLB                       611
#define G1ASDLB0                      612
#define G1ASDLB1                      613
#define CWG1CON2                      614
#define G1ASDSCLC2                    615
#define G1ASDSFLT                     616
#define G1ASDSC1                      617
#define G1ASDSC2                      618
#define G1ARSEN                       619
#define G1ASE                         620
#define CLCDATA                       621
#define MCLC1OUT                      622
#define MCLC2OUT                      623
#define MCLC3OUT                      624
#define MCLC4OUT                      625
#define CLC1CON                       626
#define LC1MODE0                      627
#define LC1MODE                       628
#define CLC1CON_LCMODE0               629
#define LC1MODE1                      630
#define CLC1CON_LCMODE1               631
#define CLC1CON_LCMODE2               632
#define LC1MODE2                      633
#define LC1INTN                       634
#define CLC1CON_LCINTN                635
#define LC1INTP                       636
#define CLC1CON_LCINTP                637
#define CLC1CON_LCOUT                 638
#define LC1OUT                        639
#define LC1OE                         640
#define CLC1CON_LCOE                  641
#define LC1EN                         642
#define CLC1CON_LCEN                  643
#define CLC1POL                       644
#define LC1G1POL                      645
#define CLC1POL_G1POL                 646
#define CLC1POL_G2POL                 647
#define LC1G2POL                      648
#define LC1G3POL                      649
#define CLC1POL_G3POL                 650
#define LC1G4POL                      651
#define CLC1POL_G4POL                 652
#define CLC1POL_POL                   653
#define LC1POL                        654
#define CLC1SEL0                      655
#define LC1D1S                        656
#define CLC1SEL0_D1S0                 657
#define LC1D1S0                       658
#define CLC1SEL0_D1S1                 659
#define LC1D1S1                       660
#define CLC1SEL0_D1S2                 661
#define LC1D1S2                       662
#define LC1D2S                        663
#define LC1D2S0                       664
#define CLC1SEL0_D2S0                 665
#define LC1D2S1                       666
#define CLC1SEL0_D2S1                 667
#define LC1D2S2                       668
#define CLC1SEL0_D2S2                 669
#define CLC1SEL1                      670
#define LC1D3S0                       671
#define CLC1SEL1_D3S0                 672
#define LC1D3S                        673
#define LC1D3S1                       674
#define CLC1SEL1_D3S1                 675
#define LC1D3S2                       676
#define CLC1SEL1_D3S2                 677
#define LC1D4S                        678
#define LC1D4S0                       679
#define CLC1SEL1_D4S0                 680
#define LC1D4S1                       681
#define CLC1SEL1_D4S1                 682
#define LC1D4S2                       683
#define CLC1SEL1_D4S2                 684
#define CLC1GLS0                      685
#define CLC1GLS0_D1N                  686
#define LC1G1D1N                      687
#define CLC1GLS0_D1T                  688
#define LC1G1D1T                      689
#define LC1G1D2N                      690
#define CLC1GLS0_D2N                  691
#define LC1G1D2T                      692
#define CLC1GLS0_D2T                  693
#define CLC1GLS0_D3N                  694
#define LC1G1D3N                      695
#define CLC1GLS0_D3T                  696
#define LC1G1D3T                      697
#define CLC1GLS0_D4N                  698
#define LC1G1D4N                      699
#define CLC1GLS0_D4T                  700
#define LC1G1D4T                      701
#define CLC1GLS1                      702
#define CLC1GLS1_D1N                  703
#define LC1G2D1N                      704
#define LC1G2D1T                      705
#define CLC1GLS1_D1T                  706
#define CLC1GLS1_D2N                  707
#define LC1G2D2N                      708
#define LC1G2D2T                      709
#define CLC1GLS1_D2T                  710
#define CLC1GLS1_D3N                  711
#define LC1G2D3N                      712
#define LC1G2D3T                      713
#define CLC1GLS1_D3T                  714
#define CLC1GLS1_D4N                  715
#define LC1G2D4N                      716
#define LC1G2D4T                      717
#define CLC1GLS1_D4T                  718
#define CLC1GLS2                      719
#define CLC1GLS2_D1N                  720
#define LC1G3D1N                      721
#define LC1G3D1T                      722
#define CLC1GLS2_D1T                  723
#define LC1G3D2N                      724
#define CLC1GLS2_D2N                  725
#define LC1G3D2T                      726
#define CLC1GLS2_D2T                  727
#define CLC1GLS2_D3N                  728
#define LC1G3D3N                      729
#define LC1G3D3T                      730
#define CLC1GLS2_D3T                  731
#define LC1G3D4N                      732
#define CLC1GLS2_D4N                  733
#define LC1G3D4T                      734
#define CLC1GLS2_D4T                  735
#define CLC1GLS3                      736
#define LC1G4D1N                      737
#define CLC1GLS3_G4D1N                738
#define LC1G4D1T                      739
#define CLC1GLS3_G4D1T                740
#define CLC1GLS3_G4D2N                741
#define LC1G4D2N                      742
#define CLC1GLS3_G4D2T                743
#define LC1G4D2T                      744
#define LC1G4D3N                      745
#define CLC1GLS3_G4D3N                746
#define LC1G4D3T                      747
#define CLC1GLS3_G4D3T                748
#define CLC1GLS3_G4D4N                749
#define LC1G4D4N                      750
#define CLC1GLS3_G4D4T                751
#define LC1G4D4T                      752
#define CLC2CON                       753
#define LC2MODE0                      754
#define LC2MODE                       755
#define CLC2CON_LCMODE0               756
#define LC2MODE1                      757
#define CLC2CON_LCMODE1               758
#define LC2MODE2                      759
#define CLC2CON_LCMODE2               760
#define LC2INTN                       761
#define CLC2CON_LCINTN                762
#define LC2INTP                       763
#define CLC2CON_LCINTP                764
#define CLC2CON_LCOUT                 765
#define LC2OUT                        766
#define LC2OE                         767
#define CLC2CON_LCOE                  768
#define CLC2CON_LCEN                  769
#define LC2EN                         770
#define CLC2POL                       771
#define LC2G1POL                      772
#define CLC2POL_G1POL                 773
#define LC2G2POL                      774
#define CLC2POL_G2POL                 775
#define LC2G3POL                      776
#define CLC2POL_G3POL                 777
#define LC2G4POL                      778
#define CLC2POL_G4POL                 779
#define CLC2POL_POL                   780
#define LC2POL                        781
#define CLC2SEL0                      782
#define LC2D1S0                       783
#define CLC2SEL0_D1S0                 784
#define LC2D1S                        785
#define LC2D1S1                       786
#define CLC2SEL0_D1S1                 787
#define LC2D1S2                       788
#define CLC2SEL0_D1S2                 789
#define LC2D2S0                       790
#define LC2D2S                        791
#define CLC2SEL0_D2S0                 792
#define LC2D2S1                       793
#define CLC2SEL0_D2S1                 794
#define LC2D2S2                       795
#define CLC2SEL0_D2S2                 796
#define CLC2SEL1                      797
#define CLC2SEL1_D3S0                 798
#define LC2D3S0                       799
#define LC2D3S                        800
#define LC2D3S1                       801
#define CLC2SEL1_D3S1                 802
#define LC2D3S2                       803
#define CLC2SEL1_D3S2                 804
#define LC2D4S                        805
#define LC2D4S0                       806
#define CLC2SEL1_D4S0                 807
#define LC2D4S1                       808
#define CLC2SEL1_D4S1                 809
#define LC2D4S2                       810
#define CLC2SEL1_D4S2                 811
#define CLC2GLS0                      812
#define LC2G1D1N                      813
#define CLC2GLS0_D1N                  814
#define CLC2GLS0_D1T                  815
#define LC2G1D1T                      816
#define LC2G1D2N                      817
#define CLC2GLS0_D2N                  818
#define CLC2GLS0_D2T                  819
#define LC2G1D2T                      820
#define LC2G1D3N                      821
#define CLC2GLS0_D3N                  822
#define CLC2GLS0_D3T                  823
#define LC2G1D3T                      824
#define LC2G1D4N                      825
#define CLC2GLS0_D4N                  826
#define CLC2GLS0_D4T                  827
#define LC2G1D4T                      828
#define CLC2GLS1                      829
#define CLC2GLS1_D1N                  830
#define LC2G2D1N                      831
#define CLC2GLS1_D1T                  832
#define LC2G2D1T                      833
#define CLC2GLS1_D2N                  834
#define LC2G2D2N                      835
#define CLC2GLS1_D2T                  836
#define LC2G2D2T                      837
#define LC2G2D3N                      838
#define CLC2GLS1_D3N                  839
#define LC2G2D3T                      840
#define CLC2GLS1_D3T                  841
#define LC2G2D4N                      842
#define CLC2GLS1_D4N                  843
#define LC2G2D4T                      844
#define CLC2GLS1_D4T                  845
#define CLC2GLS2                      846
#define LC2G3D1N                      847
#define CLC2GLS2_D1N                  848
#define CLC2GLS2_D1T                  849
#define LC2G3D1T                      850
#define CLC2GLS2_D2N                  851
#define LC2G3D2N                      852
#define LC2G3D2T                      853
#define CLC2GLS2_D2T                  854
#define CLC2GLS2_D3N                  855
#define LC2G3D3N                      856
#define CLC2GLS2_D3T                  857
#define LC2G3D3T                      858
#define CLC2GLS2_D4N                  859
#define LC2G3D4N                      860
#define LC2G3D4T                      861
#define CLC2GLS2_D4T                  862
#define CLC2GLS3                      863
#define LC2G4D1N                      864
#define CLC2GLS3_G4D1N                865
#define CLC2GLS3_G4D1T                866
#define LC2G4D1T                      867
#define CLC2GLS3_G4D2N                868
#define LC2G4D2N                      869
#define LC2G4D2T                      870
#define CLC2GLS3_G4D2T                871
#define CLC2GLS3_G4D3N                872
#define LC2G4D3N                      873
#define CLC2GLS3_G4D3T                874
#define LC2G4D3T                      875
#define LC2G4D4N                      876
#define CLC2GLS3_G4D4N                877
#define CLC2GLS3_G4D4T                878
#define LC2G4D4T                      879
#define CLC3CON                       880
#define LC3MODE                       881
#define CLC3CON_LCMODE0               882
#define LC3MODE0                      883
#define CLC3CON_LCMODE1               884
#define LC3MODE1                      885
#define CLC3CON_LCMODE2               886
#define LC3MODE2                      887
#define LC3INTN                       888
#define CLC3CON_LCINTN                889
#define LC3INTP                       890
#define CLC3CON_LCINTP                891
#define CLC3CON_LCOUT                 892
#define LC3OUT                        893
#define CLC3CON_LCOE                  894
#define LC3OE                         895
#define LC3EN                         896
#define CLC3CON_LCEN                  897
#define CLC3POL                       898
#define LC3G1POL                      899
#define CLC3POL_G1POL                 900
#define LC3G2POL                      901
#define CLC3POL_G2POL                 902
#define CLC3POL_G3POL                 903
#define LC3G3POL                      904
#define LC3G4POL                      905
#define CLC3POL_G4POL                 906
#define LC3POL                        907
#define CLC3POL_POL                   908
#define CLC3SEL0                      909
#define LC3D1S0                       910
#define LC3D1S                        911
#define CLC3SEL0_D1S0                 912
#define LC3D1S1                       913
#define CLC3SEL0_D1S1                 914
#define LC3D1S2                       915
#define CLC3SEL0_D1S2                 916
#define LC3D2S                        917
#define CLC3SEL0_D2S0                 918
#define LC3D2S0                       919
#define CLC3SEL0_D2S1                 920
#define LC3D2S1                       921
#define CLC3SEL0_D2S2                 922
#define LC3D2S2                       923
#define CLC3SEL1                      924
#define LC3D3S                        925
#define CLC3SEL1_D3S0                 926
#define LC3D3S0                       927
#define CLC3SEL1_D3S1                 928
#define LC3D3S1                       929
#define CLC3SEL1_D3S2                 930
#define LC3D3S2                       931
#define LC3D4S0                       932
#define LC3D4S                        933
#define CLC3SEL1_D4S0                 934
#define LC3D4S1                       935
#define CLC3SEL1_D4S1                 936
#define LC3D4S2                       937
#define CLC3SEL1_D4S2                 938
#define CLC3GLS0                      939
#define CLC3GLS0_D1N                  940
#define LC3G1D1N                      941
#define LC3G1D1T                      942
#define CLC3GLS0_D1T                  943
#define LC3G1D2N                      944
#define CLC3GLS0_D2N                  945
#define CLC3GLS0_D2T                  946
#define LC3G1D2T                      947
#define CLC3GLS0_D3N                  948
#define LC3G1D3N                      949
#define LC3G1D3T                      950
#define CLC3GLS0_D3T                  951
#define CLC3GLS0_D4N                  952
#define LC3G1D4N                      953
#define CLC3GLS0_D4T                  954
#define LC3G1D4T                      955
#define CLC3GLS1                      956
#define LC3G2D1N                      957
#define CLC3GLS1_D1N                  958
#define CLC3GLS1_D1T                  959
#define LC3G2D1T                      960
#define LC3G2D2N                      961
#define CLC3GLS1_D2N                  962
#define LC3G2D2T                      963
#define CLC3GLS1_D2T                  964
#define LC3G2D3N                      965
#define CLC3GLS1_D3N                  966
#define CLC3GLS1_D3T                  967
#define LC3G2D3T                      968
#define LC3G2D4N                      969
#define CLC3GLS1_D4N                  970
#define LC3G2D4T                      971
#define CLC3GLS1_D4T                  972
#define CLC3GLS2                      973
#define LC3G3D1N                      974
#define CLC3GLS2_D1N                  975
#define LC3G3D1T                      976
#define CLC3GLS2_D1T                  977
#define CLC3GLS2_D2N                  978
#define LC3G3D2N                      979
#define CLC3GLS2_D2T                  980
#define LC3G3D2T                      981
#define CLC3GLS2_D3N                  982
#define LC3G3D3N                      983
#define LC3G3D3T                      984
#define CLC3GLS2_D3T                  985
#define CLC3GLS2_D4N                  986
#define LC3G3D4N                      987
#define CLC3GLS2_D4T                  988
#define LC3G3D4T                      989
#define CLC3GLS3                      990
#define LC3G4D1N                      991
#define CLC3GLS3_G4D1N                992
#define LC3G4D1T                      993
#define CLC3GLS3_G4D1T                994
#define LC3G4D2N                      995
#define CLC3GLS3_G4D2N                996
#define CLC3GLS3_G4D2T                997
#define LC3G4D2T                      998
#define LC3G4D3N                      999
#define CLC3GLS3_G4D3N                1000
#define CLC3GLS3_G4D3T                1001
#define LC3G4D3T                      1002
#define LC3G4D4N                      1003
#define CLC3GLS3_G4D4N                1004
#define LC3G4D4T                      1005
#define CLC3GLS3_G4D4T                1006
#define CLC4CON                       1007
#define LC4MODE                       1008
#define LC4MODE0                      1009
#define CLC4CON_LCMODE0               1010
#define CLC4CON_LCMODE1               1011
#define LC4MODE1                      1012
#define LC4MODE2                      1013
#define CLC4CON_LCMODE2               1014
#define CLC4CON_LCINTN                1015
#define LC4INTN                       1016
#define CLC4CON_LCINTP                1017
#define LC4INTP                       1018
#define LC4OUT                        1019
#define CLC4CON_LCOUT                 1020
#define CLC4CON_LCOE                  1021
#define LC4OE                         1022
#define CLC4CON_LCEN                  1023
#define LC4EN                         1024
#define CLC4POL                       1025
#define CLC4POL_G1POL                 1026
#define LC4G1POL                      1027
#define CLC4POL_G2POL                 1028
#define LC4G2POL                      1029
#define CLC4POL_G3POL                 1030
#define LC4G3POL                      1031
#define LC4G4POL                      1032
#define CLC4POL_G4POL                 1033
#define LC4POL                        1034
#define CLC4POL_POL                   1035
#define CLC4SEL0                      1036
#define CLC4SEL0_D1S0                 1037
#define LC4D1S0                       1038
#define LC4D1S                        1039
#define CLC4SEL0_D1S1                 1040
#define LC4D1S1                       1041
#define CLC4SEL0_D1S2                 1042
#define LC4D1S2                       1043
#define LC4D2S                        1044
#define LC4D2S0                       1045
#define CLC4SEL0_D2S0                 1046
#define LC4D2S1                       1047
#define CLC4SEL0_D2S1                 1048
#define LC4D2S2                       1049
#define CLC4SEL0_D2S2                 1050
#define CLC4SEL1                      1051
#define LC4D3S                        1052
#define CLC4SEL1_D3S0                 1053
#define LC4D3S0                       1054
#define CLC4SEL1_D3S1                 1055
#define LC4D3S1                       1056
#define CLC4SEL1_D3S2                 1057
#define LC4D3S2                       1058
#define LC4D4S                        1059
#define LC4D4S0                       1060
#define CLC4SEL1_D4S0                 1061
#define LC4D4S1                       1062
#define CLC4SEL1_D4S1                 1063
#define LC4D4S2                       1064
#define CLC4SEL1_D4S2                 1065
#define CLC4GLS0                      1066
#define CLC4GLS0_D1N                  1067
#define LC4G1D1N                      1068
#define CLC4GLS0_D1T                  1069
#define LC4G1D1T                      1070
#define CLC4GLS0_D2N                  1071
#define LC4G1D2N                      1072
#define CLC4GLS0_D2T                  1073
#define LC4G1D2T                      1074
#define CLC4GLS0_D3N                  1075
#define LC4G1D3N                      1076
#define CLC4GLS0_D3T                  1077
#define LC4G1D3T                      1078
#define CLC4GLS0_D4N                  1079
#define LC4G1D4N                      1080
#define CLC4GLS0_D4T                  1081
#define LC4G1D4T                      1082
#define CLC4GLS1                      1083
#define CLC4GLS1_D1N                  1084
#define LC4G2D1N                      1085
#define CLC4GLS1_D1T                  1086
#define LC4G2D1T                      1087
#define LC4G2D2N                      1088
#define CLC4GLS1_D2N                  1089
#define LC4G2D2T                      1090
