tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1508_tdd.h
#define CLC4GLS1_D2T                  1091
#define CLC4GLS1_D3N                  1092
#define LC4G2D3N                      1093
#define LC4G2D3T                      1094
#define CLC4GLS1_D3T                  1095
#define CLC4GLS1_D4N                  1096
#define LC4G2D4N                      1097
#define CLC4GLS1_D4T                  1098
#define LC4G2D4T                      1099
#define CLC4GLS2                      1100
#define CLC4GLS2_D1N                  1101
#define LC4G3D1N                      1102
#define CLC4GLS2_D1T                  1103
#define LC4G3D1T                      1104
#define LC4G3D2N                      1105
#define CLC4GLS2_D2N                  1106
#define LC4G3D2T                      1107
#define CLC4GLS2_D2T                  1108
#define CLC4GLS2_D3N                  1109
#define LC4G3D3N                      1110
#define CLC4GLS2_D3T                  1111
#define LC4G3D3T                      1112
#define LC4G3D4N                      1113
#define CLC4GLS2_D4N                  1114
#define LC4G3D4T                      1115
#define CLC4GLS2_D4T                  1116
#define CLC4GLS3                      1117
#define CLC4GLS3_G4D1N                1118
#define LC4G4D1N                      1119
#define LC4G4D1T                      1120
#define CLC4GLS3_G4D1T                1121
#define LC4G4D2N                      1122
#define CLC4GLS3_G4D2N                1123
#define LC4G4D2T                      1124
#define CLC4GLS3_G4D2T                1125
#define CLC4GLS3_G4D3N                1126
#define LC4G4D3N                      1127
#define CLC4GLS3_G4D3T                1128
#define LC4G4D3T                      1129
#define LC4G4D4N                      1130
#define CLC4GLS3_G4D4N                1131
#define LC4G4D4T                      1132
#define CLC4GLS3_G4D4T                1133
#define ICDIO                         1134
#define TRIS_ICDCLK                   1135
#define TRIS_ICDDAT                   1136
#define LAT_ICDCLK                    1137
#define LAT_ICDDAT                    1138
#define PORT_ICDCLK                   1139
#define PORT_ICDDAT                   1140
#define ICDCON0                       1141
#define RSTVEC                        1142
#define DBGINEX                       1143
#define SSTEP                         1144
#define FREEZ                         1145
#define INBUG                         1146
#define ICDSTAT                       1147
#define USRHLTF                       1148
#define TRP0HLTF                      1149
#define TRP1HLTF                      1150
#define DEVSEL                        1151
#define DEVSEL0                       1152
#define DEVSEL1                       1153
#define DEVSEL2                       1154
#define ICDINSTL                      1155
#define DBGIN0                        1156
#define DBGIN1                        1157
#define DBGIN2                        1158
#define DBGIN3                        1159
#define DBGIN4                        1160
#define DBGIN5                        1161
#define DBGIN6                        1162
#define DBGIN7                        1163
#define ICDINSTH                      1164
#define DBGIN8                        1165
#define DBGIN9                        1166
#define DBGIN10                       1167
#define DBGIN11                       1168
#define DBGIN12                       1169
#define DBGIN13                       1170
#define ICDBK0CON                     1171
#define BKHLT                         1172
#define BKEN                          1173
#define ICDBK0L                       1174
#define BKA0                          1175
#define BKA1                          1176
#define BKA2                          1177
#define BKA3                          1178
#define BKA4                          1179
#define BKA5                          1180
#define BKA6                          1181
#define BKA7                          1182
#define ICDBK0H                       1183
#define BKA8                          1184
#define BKA9                          1185
#define BKA10                         1186
#define BKA11                         1187
#define BKA12                         1188
#define BKA13                         1189
#define BKA14                         1190
#define BSRICDSHAD                    1191
#define BSR_ICDSHAD                   1192
#define STATUS_SHAD                   1193
#define C_SHAD                        1194
#define DC_SHAD                       1195
#define Z_SHAD                        1196
#define WREG_SHAD                     1197
#define BSR_SHAD                      1198
#define PCLATH_SHAD                   1199
#define FSR0L_SHAD                    1200
#define FSR0H_SHAD                    1201
#define FSR1L_SHAD                    1202
#define FSR1H_SHAD                    1203
#define STKPTR                        1204
#define TOSL                          1205
#define TOSH                          1206

#endif // _PIC16LF1508_H_
